AppRegime/app/Controllers/CodeController.php

    public function use_code()
    {
        $code_id = $this->request->getPost('code_id');
        $user_id = session()->get('user_id');

        if (!$code_id || !$user_id) {
            return redirect()->back()->with('error', 'Code ou utilisateur invalide.');
        }

        $codeModel = new \App\Models\Code();
        $codeHistoriqueModel = new \App\Models\CodeHistorique();
        $userModel = new \App\Models\UserModel();

        // Fetch le code_montant
        $code = $codeModel->find($code_id);
        if (!$code) {
            return redirect()->back()->with('error', 'Code non trouvé.');
        }

        // Fetch l'utilisateur
        $user = $userModel->find($user_id);
        if (!$user) {
            return redirect()->back()->with('error', 'Utilisateur non trouvé.');
        }

        // Ajoute le montant au solde
        $newSolde = $user['solde'] + $code['montant'];
        $userModel->update($user_id, ['solde' => $newSolde]);

        // Crée un enregistrement dans l'historique
        $codeHistoriqueModel->insert([
            'code_id' => $code_id,
            'utilisateur_id' => $user_id,
            'utilise' => 1,
        ]);
---
INSERT INTO `code` (`code_id`, `utilisateur_id`, `utilise`) VALUES ('2', '1', 1)