app/Controllers/Home.php

SELECT *
FROM `utilisateur_objectif`
WHERE `utilisateur_id` = 5
ORDER BY `id` DESC
 LIMIT 1
---
    public function index(): string
    {
        $userId = (int) session()->get('user_id');
        $user = (new UserModel())->find($userId);
        $utilisateurObjectif = null;

        if ($user !== null) {
            $utilisateurObjectif = (new UtilisateurObjectifModel())
                ->where('utilisateur_id', $userId)
                ->orderBy('id', 'DESC')
                ->first();