app/Controllers/ObjectifsController.php

SELECT *
FROM `objectif`
WHERE `objectif`.`id` = 1
---
    public function submit()
    {
        $utilisateurId = (int) ($this->request->getPost('utilisateur_id') ?? session()->get('user_id'));
        $objectifId = (int) $this->request->getPost('objectif');

        $validationRules = [
            'objectif' => 'required|is_natural_no_zero',
        ];

        if ($utilisateurId > 0) {
            $validationRules['utilisateur_id'] = 'required|is_natural_no_zero';
        }

        if (! $this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('error', 'Selection invalide, veuillez reessayer.');
        }

        $objectif = $this->objectifsModel->find($objectifId);