app/Controllers/RegimeController.php

    public function details(int $id)
    {
        $regimeModel = new RegimeModel();
        $prixRegimeModel = new PrixRegimeModel();

        $regime = $regimeModel->find($id);

        if ($regime === null) {
            return redirect()->back()->with('error', 'Regime introuvable.');
---
SELECT *
FROM `regime`
WHERE `regime`.`id` = 5
SELECT *
FROM `regime`