app/Controllers/SuggestionController.php

    public function index()
    {
        $objectifsModel = new ObjectifModel();
        $objectifs = $objectifsModel->findAll();
        $objectifId = (int) $this->request->getGet('objectif_id');
        $utilisateurId = (int) ($this->request->getGet('utilisateur_id') ?? session()->get('user_id'));
        $regimes = [];
        $activites = [];
        $utilisateur = null;
        $utilisateurObjectif = null;
        $imc = null;
        $categorieImc = null;
        $imcCible = null;
        $poidsCible = null;
        $imcIdealAtteint = null;
        $ecartImcCible = null;

        if ($utilisateurId > 0) {
            $userModel = new UserModel();
            $utilisateur = $userModel->find($utilisateurId);
            $utilisateurObjectifModel = new UtilisateurObjectifModel();
            $utilisateurObjectif = $utilisateurObjectifModel
                ->where('utilisateur_id', $utilisateurId)
                ->where('objectif_id', $objectifId)
                ->orderBy('id', 'DESC')
                ->first();
---
SELECT *
FROM `objectif`
SELECT *
FROM `utilisateur_objectif`
WHERE `utilisateur_id` = 1
AND `objectif_id` = 1
ORDER BY `id` DESC
 LIMIT 1

    public function exportPdf()
    {
        require_once APPPATH . 'Libraries/fpdf/fpdf.php';

        $userId = (int) session()->get('user_id');
        $objectifId = (int) $this->request->getGet('objectif_id');

        $userModel = new UserModel();
        $objectifModel = new ObjectifModel();
        $utilisateurObjectifModel = new UtilisateurObjectifModel();
        $regimeObjectifModel = new RegimeObjectifModel();
        $activiteObjectifModel = new ActiviteObjectifModel();

        $utilisateur = $userModel->find($userId);
        if ($utilisateur === null) {
            return redirect()->to(site_url('connexion'))->with('error', 'Veuillez vous connecter.');
        }

        if ($objectifId <= 0) {
            $lastObjectif = $utilisateurObjectifModel
                ->where('utilisateur_id', $userId)
                ->orderBy('id', 'DESC')
                ->first();
            $objectifId = (int) ($lastObjectif['objectif_id'] ?? 0);
        }

        $objectif = $objectifModel->find($objectifId);
---
SELECT *
FROM `utilisateur_objectif`
WHERE `utilisateur_id` = 1
AND `objectif_id` = 1
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `objectif`
WHERE `objectif`.`id` = 1