app/Models/ActiviteObjectifModel.php

SELECT `activite_objectif`.*, `activite_sportive`.`nom` as `activite_nom`, `activite_sportive`.`calories_brulees_par_heure`, (activite_sportive.calories_brulees_par_heure * activite_objectif.duree_minutes_par_seance / 60) as calories_par_seance, (activite_sportive.calories_brulees_par_heure * activite_objectif.duree_minutes_par_seance / 60 * activite_objectif.frequence_par_semaine) as calories_par_semaine
FROM `activite_objectif`
JOIN `activite_sportive` ON `activite_sportive`.`id` = `activite_objectif`.`activite_id`
WHERE `activite_objectif`.`objectif_id` = 1
SELECT `activite_objectif`.*, `activite_sportive`.`nom` as `activite_nom`
FROM `activite_objectif`
JOIN `activite_sportive` ON `activite_sportive`.`id` = `activite_objectif`.`activite_id`
WHERE `activite_objectif`.`objectif_id` = 3
---
    public function getActivitesByObjectifId(int $objectifId): array
    {
        return $this->select(
            'activite_objectif.*, activite_sportive.nom as activite_nom, '
            . 'activite_sportive.calories_brulees_par_heure, '
            . '(activite_sportive.calories_brulees_par_heure * activite_objectif.duree_minutes_par_seance / 60) as calories_par_seance, '
            . '(activite_sportive.calories_brulees_par_heure * activite_objectif.duree_minutes_par_seance / 60 * activite_objectif.frequence_par_semaine) as calories_par_semaine'
        )
            ->join('activite_sportive', 'activite_sportive.id = activite_objectif.activite_id')
            ->where('activite_objectif.objectif_id', $objectifId)
            ->findAll();