app/Models/Objectifs.php

    public function getSelectableObjectifs(): array
    {
        return $this->select('id, type')
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT `id`, `type`
FROM `objectifs`
ORDER BY `id` ASC