app/Models/PrixRegimeModel.php

    public function getPrixByRegimeId(int $regimeId): array
    {
        return $this->where('regime_id', $regimeId)
            ->orderBy('duree_jours', 'ASC')
            ->findAll();
---
SELECT *
FROM `prix_regimes`
WHERE `regime_id` = 5
ORDER BY `duree_jours` ASC