app/Models/RegimeObjectifModel.php

    public function getRegimesByObjectifId(int $objectifId): array
    {
        return $this->select(
            'regime_objectif.*, regime.nom as regime_nom, regime.pourcentage_viandes, '
            . 'regime.pourcentage_poissons, regime.pourcentage_volailles, prix_regimes.prix as prix'
        )
            ->join('regime', 'regime.id = regime_objectif.regime_id')
            ->join(
                'prix_regimes',
                'prix_regimes.regime_id = regime_objectif.regime_id '
                . 'AND prix_regimes.duree_jours = regime_objectif.duree_jours',
                'left'
            )
            ->where('regime_objectif.objectif_id', $objectifId)
            ->findAll();
---
SELECT `regime_objectif`.*, `regime`.`nom` as `regime_nom`, `regime`.`pourcentage_viandes`, `regime`.`pourcentage_poissons`, `regime`.`pourcentage_volailles`, `prix_regimes`.`prix` as `prix`
FROM `regime_objectif`
JOIN `regime` ON `regime`.`id` = `regime_objectif`.`regime_id`
LEFT JOIN `prix_regimes` ON `prix_regimes`.`regime_id` = `regime_objectif`.`regime_id` AND `prix_regimes`.`duree_jours` = `regime_objectif`.`duree_jours`
WHERE `regime_objectif`.`objectif_id` = 1