app/Models/StatutModel.php

SELECT `id`
FROM `statut`
WHERE `nom` = 'En cours'
 LIMIT 1
---
    public function getDefaultId(): int
    {
        $statut = $this->select('id')
            ->where('nom', 'En cours')
            ->first();