app/Models/UtilisateurObjectifModel.php

    public function setObjectifForUser(int $utilisateurId, int $objectifId): bool
    {
        $existing = $this->where('utilisateur_id', $utilisateurId)->first();
        $statutModel = new StatutModel();
        $statutId = $statutModel->getDefaultId();

        if ($existing === null) {
            return $this->insert([
                'utilisateur_id' => $utilisateurId,
                'objectif_id' => $objectifId,
                'statut_id' => $statutId,
            ]) !== false;
        }

        return $this->update((int) $existing['id'], [
            'objectif_id' => $objectifId,
            'statut_id' => $statutId,
        ]);
---
SELECT *
FROM `utilisateur_objectif`
WHERE `utilisateur_id` = 5
 LIMIT 1
UPDATE `utilisateur_objectif` SET `objectif_id` = 1, `statut_id` = 1, `imc_cible` = NULL
WHERE `utilisateur_objectif`.`id` IN (5)